'''
你正在設計一個函式以讀取資料檔案並將結果列印為格式化表格。
資料檔案中包含有關蔬菜的資訊。每個記錄都包含蔬菜的名稱、重量和價格。
你需要列印資料,使其看起來像下面的範例:
Potatos 5.4 2.33
Carrots 2.5 1.50
Corns   5.2 5.96
具體地說,列印輸出必須符合以下要求:
1. 蔬菜名稱必須印在10個空格範內並靠左對齊。
2. 重量必須印在5個範內並靠右對齊,小數點最多一個位數。
3. 價格必須印在7個空格範圍內並靠右對齊,小數點後最多兩位數。
你創建了以下的程式碼。其中包含的行號只是做為參考。
01 def print_table(file):
02  data = open(file,'r')
03  for record in data:
04      fields = record.split(",")

你應該如何完成05行的程式碼?請將適合的程式碼片段選項填到正確的位置上。
每個程式碼片段都可以使用一次、多次,或者不使用。
回答區
"(A )(B )(C )(D ).format(fields[0], eval(fields[1]), eval(fields[2])))
程式碼片段
A. print("
B. {10:0}
C. {5:1f}
D. {7:2f}
E. {2:7.2f}
F. {1:5.1f}
G. {0:10}
'''